In [1]:
from modules.settings import POSTGRES_DB,POSTGRES_USER,POSTGRES_PASSWORD
from modules.database import create_connection,execute_read_query

In [2]:
# Define your database credentials and details
db_name = POSTGRES_DB
db_user = POSTGRES_USER
db_password = POSTGRES_PASSWORD
db_host = "chinook_db"  # or the IP if your database is remote
db_port = 5432

# Create a connection
connection = create_connection(db_name, db_user, db_password, db_host, db_port)

Connection to PostgreSQL DB successful

Task A1: Who is the employee that served more customers?

In [3]:
# Query the view
query_a1 = '''SELECT * FROM top_employee_by_customers'''

# Fetch data into DataFrame
df_a1 = execute_read_query(connection, query_a1)
df_a1

   employee_id first_name last_name  numberofcustomers
0            3       Jane   Peacock                 21

Task A2: Who is the customer that bought more tracks?

In [4]:
# Query the view
query_a2 = '''SELECT * FROM top_customer_by_tracks'''

# Fetch data into DataFrame
df_a2 = execute_read_query(connection, query_a2)
df_a2

   customer_id first_name last_name  number_of_tracks
0           29     Robert     Brown                38

Task A3: Who is the employee that manages more employees?

In [5]:
# Query the view
query_a3 = '''
SELECT * FROM top_manager_by_direct_reports;
'''
# Fetch data into DataFrame
df_a3 = execute_read_query(connection, query_a3)
df_a3

   employee_id first_name last_name  number_of_direct_reports
0            2      Nancy   Edwards                         3

Task A4: Find the top-3 playlists in terms of profit for the media store

In [7]:
# Query the view
query_a4 = '''
SELECT * FROM top_playlists_by_profit 
'''
# Fetch data into DataFrame
df_a4 = execute_read_query(connection, query_a4)
df_a4

   playlist_id playlistname totalprofit
0            8        Music     2107.71
1            1        Music     2107.71
2            5   90’s Music      944.46